solana-load-test.yml
config:
  target:  'https://api.mainnet-beta.solana.com'
  phases:
    - duration: 60
      arrivalRate: 10 # Change number of requests per second here
scenarios:
  - flow:
      - post:
          url: "/"
          json:
            id: 1
            jsonrpc: "2.0"
            method: "getConfirmedBlock"
            params: [1]